
       F(  1,    16) =   64.80
            Prob > F =    0.0000

Linear regression                               Number of obs     =         22
                                                F(5, 16)          =      65.40
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9129
                                                Root MSE          =     .00645

--------------------------------------------------------------------------------------------
                           |               Robust
     Ma3DLnRealAverageWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma3DLnNetProductivityNDP |    .305915   .2622872     1.17   0.261    -.2501089    .8619389
 Ma3UnemploymentRestricted |  -.9933477   .4998361    -1.99   0.064    -2.052953    .0662575
Ma3LUnemploymentRestricted |   .1876428   .4765923     0.39   0.699    -.8226878    1.197973
           Ma3CPIInflation |  -.7429738   .2120412    -3.50   0.003    -1.192481   -.2934665
                     trend |  -.0018128    .000488    -3.71   0.002    -.0028472   -.0007783
                     _cons |   .0881726   .0108629     8.12   0.000     .0651444    .1112009
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP = 1

       F(  1,    16) =    7.00
            Prob > F =    0.0176

Linear regression                               Number of obs     =         22
                                                F(5, 16)          =      77.59
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9464
                                                Root MSE          =     .00607

--------------------------------------------------------------------------------------------
                           |               Robust
Ma3DLnRealAverageCompens~n | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma3DLnNetProductivityNDP |     .87116   .2230695     3.91   0.001     .3982738    1.344046
 Ma3UnemploymentRestricted |  -.7741013   .3459375    -2.24   0.040    -1.507456   -.0407467
Ma3LUnemploymentRestricted |  -.1925377   .3237316    -0.59   0.560     -.878818    .4937426
           Ma3CPIInflation |  -.7354436   .1997852    -3.68   0.002    -1.158969    -.311918
                     trend |  -.0014995   .0003198    -4.69   0.000    -.0021775   -.0008215
                     _cons |   .0882896   .0107914     8.18   0.000     .0654129    .1111663
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP = 1

       F(  1,    16) =    0.33
            Prob > F =    0.5716

. 
end of do-file

. do "C:\Users\Admin\AppData\Local\Temp\STD6554_000000.tmp"

. //Dummy Variables test
. //Median Wage
. reg Ma3DLnRealMedianWage Ma3DLnNetProductivityNDP Ma3UnemploymentRestricted Ma3LUnemploymentRestricted Ma3CPIInflation dummy_Ma3DLnNetProductivityNDP, robust

Linear regression                               Number of obs     =         22
                                                F(5, 16)          =      86.56
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9240
                                                Root MSE          =     .00514

------------------------------------------------------------------------------------------------
                               |               Robust
          Ma3DLnRealMedianWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------------+----------------------------------------------------------------
      Ma3DLnNetProductivityNDP |  -.2045385   .4204674    -0.49   0.633     -1.09589    .6868126
     Ma3UnemploymentRestricted |  -.6495844    .477411    -1.36   0.192     -1.66165    .3624817
    Ma3LUnemploymentRestricted |  -.0507671   .4389886    -0.12   0.909    -.9813815    .8798472
               Ma3CPIInflation |  -.7194455   .2329112    -3.09   0.007    -1.213195   -.2256958
dummy_Ma3DLnNetProductivityNDP |   1.147435   .3968765     2.89   0.011     .3060942    1.988775
                         _cons |   .0527935   .0065015     8.12   0.000      .039011    .0665761
------------------------------------------------------------------------------------------------

. test Ma3DLnNetProductivityNDP + dummy_Ma3DLnNetProductivityNDP = 1

 ( 1)  Ma3DLnNetProductivityNDP + dummy_Ma3DLnNetProductivityNDP = 1

       F(  1,    16) =    0.32
            Prob > F =    0.5815

. 
. //Mean Wage
. reg Ma3DLnRealAverageWage Ma3DLnNetProductivityNDP Ma3UnemploymentRestricted Ma3LUnemploymentRestricted Ma3CPIInflation dummy_Ma3DLnNetProductivityNDP, robust

Linear regression                               Number of obs     =         22
                                                F(5, 16)          =      43.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8861
                                                Root MSE          =     .00737

------------------------------------------------------------------------------------------------
                               |               Robust
         Ma3DLnRealAverageWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------------+----------------------------------------------------------------
      Ma3DLnNetProductivityNDP |   .2897227   .5580921     0.52   0.611    -.8933798    1.472825
     Ma3UnemploymentRestricted |  -.0356193   .6078097    -0.06   0.954    -1.324118     1.25288
    Ma3LUnemploymentRestricted |  -.5584444   .5517992    -1.01   0.327    -1.728207    .6113177
               Ma3CPIInflation |  -.7875227   .3068223    -2.57   0.021    -1.437957   -.1370884
dummy_Ma3DLnNetProductivityNDP |   1.044479   .5312816     1.97   0.067    -.0817875    2.170746
                         _cons |   .0479055   .0100826     4.75   0.000     .0265313    .0692798
------------------------------------------------------------------------------------------------

. test Ma3DLnNetProductivityNDP + dummy_Ma3DLnNetProductivityNDP = 1

 ( 1)  Ma3DLnNetProductivityNDP + dummy_Ma3DLnNetProductivityNDP = 1

       F(  1,    16) =    4.71
            Prob > F =    0.0453

. 
. //Mean Comp
. reg Ma3DLnRealAverageCompensation Ma3DLnNetProductivityNDP Ma3UnemploymentRestricted Ma3LUnemploymentRestricted Ma3CPIInflation dummy_Ma3DLnNetProductivityNDP, robust

Linear regression                               Number of obs     =         22
                                                F(5, 16)          =      63.96
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9367
                                                Root MSE          =      .0066

------------------------------------------------------------------------------------------------
                               |               Robust
 Ma3DLnRealAverageCompensation | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------------+----------------------------------------------------------------
      Ma3DLnNetProductivityNDP |   .7553288   .4297835     1.76   0.098    -.1557716    1.666429
     Ma3UnemploymentRestricted |  -.0689217   .3980936    -0.17   0.865    -.9128423     .774999
    Ma3LUnemploymentRestricted |  -.7332628   .3772401    -1.94   0.070    -1.532976    .0664505
               Ma3CPIInflation |  -.7362231   .2485328    -2.96   0.009    -1.263089   -.2093571
dummy_Ma3DLnNetProductivityNDP |   .9579091   .3551499     2.70   0.016     .2050249    1.710793
                         _cons |   .0546141   .0077638     7.03   0.000     .0381555    .0710728
------------------------------------------------------------------------------------------------

. test Ma3DLnNetProductivityNDP + dummy_Ma3DLnNetProductivityNDP = 1

 ( 1)  Ma3DLnNetProductivityNDP + dummy_Ma3DLnNetProductivityNDP = 1

       F(  1,    16) =   19.56
            Prob > F =    0.0004

. 
end of do-file

. do "C:\Users\Admin\AppData\Local\Temp\STD6554_000000.tmp"

. foreach var of varlist DLnRealMedianWage DLnRealAverageWage DLnRealAverageCompensation {
  2.         reg `var' DLnNetProductivityNDP UnemploymentRestricted L.UnemploymentRestricted CPIInflation, robust
  3.         test DLnNetProductivityNDP = 1
  4. }

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =       8.85
                                                Prob > F          =     0.0005
                                                R-squared         =     0.7344
                                                Root MSE          =     .01097

----------------------------------------------------------------------------------------
                       |               Robust
     DLnRealMedianWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
 DLnNetProductivityNDP |   .6207991   .1989581     3.12   0.006     .2010342    1.040564
                       |
UnemploymentRestricted |
                   --. |   -.292088   .4880682    -0.60   0.557    -1.321822    .7376459
                   L1. |  -.4843355   .5737072    -0.84   0.410    -1.694752     .726081
                       |
          CPIInflation |  -1.067386   .2398534    -4.45   0.000    -1.573432   -.5613394
                 _cons |   .0674438   .0121812     5.54   0.000     .0417437    .0931439
----------------------------------------------------------------------------------------

 ( 1)  DLnNetProductivityNDP = 1

       F(  1,    17) =    3.63
            Prob > F =    0.0737

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      13.03
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6850
                                                Root MSE          =     .01275

----------------------------------------------------------------------------------------
                       |               Robust
    DLnRealAverageWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
 DLnNetProductivityNDP |   .8270822   .2448329     3.38   0.004     .3105299    1.343634
                       |
UnemploymentRestricted |
                   --. |  -.0442959   .5660392    -0.08   0.939    -1.238534    1.149942
                   L1. |  -.7327666   .6706094    -1.09   0.290    -2.147629    .6820956
                       |
          CPIInflation |  -1.008934   .2561766    -3.94   0.001     -1.54942   -.4684488
                 _cons |   .0656551   .0115204     5.70   0.000     .0413492     .089961
----------------------------------------------------------------------------------------

 ( 1)  DLnNetProductivityNDP = 1

       F(  1,    17) =    0.50
            Prob > F =    0.4896

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      22.64
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7837
                                                Root MSE          =     .01335

----------------------------------------------------------------------------------------
                       |               Robust
DLnRealAverageCompen~n | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
 DLnNetProductivityNDP |   1.485718   .2422085     6.13   0.000     .9747028    1.996733
                       |
UnemploymentRestricted |
                   --. |   .2880314   .5865416     0.49   0.630    -.9494632    1.525526
                   L1. |  -1.070353   .6344575    -1.69   0.110    -2.408941    .2682356
                       |
          CPIInflation |  -1.141161   .2639747    -4.32   0.000    -1.698099   -.5842228
                 _cons |   .0659354   .0112138     5.88   0.000     .0422763    .0895946
----------------------------------------------------------------------------------------

 ( 1)  DLnNetProductivityNDP = 1

       F(  1,    17) =    4.02
            Prob > F =    0.0611

. 
end of do-file

. do "C:\Users\Admin\AppData\Local\Temp\STD6554_000000.tmp"

. foreach var of varlist DLnRealMedianWage DLnRealAverageWage DLnRealAverageCompensation {
  2.         reg `var' DLnNetProductivityNDP UnemploymentRestricted L.UnemploymentRestricted, robust
  3.         test DLnNetProductivityNDP = 1
  4. }

Linear regression                               Number of obs     =         22
                                                F(3, 18)          =       3.78
                                                Prob > F          =     0.0290
                                                R-squared         =     0.3594
                                                Root MSE          =     .01656

----------------------------------------------------------------------------------------
                       |               Robust
     DLnRealMedianWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
 DLnNetProductivityNDP |   .3203026   .2292875     1.40   0.179    -.1614126    .8020177
                       |
UnemploymentRestricted |
                   --. |  -.2455814   .7757338    -0.32   0.755    -1.875338    1.384175
                   L1. |  -.7787912   .6680244    -1.17   0.259    -2.182259     .624676
                       |
                 _cons |   .0530591    .019323     2.75   0.013      .012463    .0936551
----------------------------------------------------------------------------------------

 ( 1)  DLnNetProductivityNDP = 1

       F(  1,    18) =    8.79
            Prob > F =    0.0083

Linear regression                               Number of obs     =         22
                                                F(3, 18)          =       5.95
                                                Prob > F          =     0.0053
                                                R-squared         =     0.3910
                                                Root MSE          =     .01723

----------------------------------------------------------------------------------------
                       |               Robust
    DLnRealAverageWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
 DLnNetProductivityNDP |   .5430412   .2550212     2.13   0.047     .0072616    1.078821
                       |
UnemploymentRestricted |
                   --. |   -.000336   .7963816    -0.00   1.000    -1.673472      1.6728
                   L1. |  -1.011097   .7293226    -1.39   0.183    -2.543347    .5211524
                       |
                 _cons |   .0520582   .0177798     2.93   0.009     .0147042    .0894121
----------------------------------------------------------------------------------------

 ( 1)  DLnNetProductivityNDP = 1

       F(  1,    18) =    3.21
            Prob > F =    0.0900

Linear regression                               Number of obs     =         22
                                                F(3, 18)          =      11.57
                                                Prob > F          =     0.0002
                                                R-squared         =     0.5480
                                                Root MSE          =     .01875

----------------------------------------------------------------------------------------
                       |               Robust
DLnRealAverageCompen~n | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
 DLnNetProductivityNDP |   1.164452   .3394193     3.43   0.003     .4513586    1.877545
                       |
UnemploymentRestricted |
                   --. |   .3377525   .9961099     0.34   0.738    -1.754997    2.430502
                   L1. |   -1.38516   .8445027    -1.64   0.118    -3.159395    .3890739
                       |
                 _cons |   .0505565   .0178762     2.83   0.011         .013     .088113
----------------------------------------------------------------------------------------

 ( 1)  DLnNetProductivityNDP = 1

       F(  1,    18) =    0.23
            Prob > F =    0.6339

. 
end of do-file

. do "C:\Users\Admin\AppData\Local\Temp\STD6554_000000.tmp"

. //Moving Averages Test
. foreach var of varlist Ma2DLnRealMedianWage Ma2DLnRealAverageWage Ma2DLnRealAverageCompensation {
  2.         reg `var' Ma2DLnNetProductivityNDP Ma2UnemploymentRestricted Ma2LUnemploymentRestricted Ma2CPIInflation, robust
  3.         test Ma2DLnNetProductivityNDP = 1
  4. }

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      17.12
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8017
                                                Root MSE          =     .00862

--------------------------------------------------------------------------------------------
                           |               Robust
      Ma2DLnRealMedianWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma2DLnNetProductivityNDP |   .8113519   .1903954     4.26   0.001     .4096526    1.213051
 Ma2UnemploymentRestricted |   .0863018   .5025506     0.17   0.866    -.9739873    1.146591
Ma2LUnemploymentRestricted |   -.742352   .4759957    -1.56   0.137    -1.746615    .2619111
           Ma2CPIInflation |  -1.179241    .289787    -4.07   0.001    -1.790639   -.5678443
                     _cons |   .0636428   .0119455     5.33   0.000       .03844    .0888456
--------------------------------------------------------------------------------------------

 ( 1)  Ma2DLnNetProductivityNDP = 1

       F(  1,    17) =    0.98
            Prob > F =    0.3357

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      21.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7655
                                                Root MSE          =     .01057

--------------------------------------------------------------------------------------------
                           |               Robust
     Ma2DLnRealAverageWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma2DLnNetProductivityNDP |   1.108731   .2363096     4.69   0.000     .6101615    1.607301
 Ma2UnemploymentRestricted |   .4807206    .605865     0.79   0.438    -.7975428    1.758984
Ma2LUnemploymentRestricted |  -1.105487    .567898    -1.95   0.068    -2.303647    .0926727
           Ma2CPIInflation |  -1.169239   .3188184    -3.67   0.002    -1.841887   -.4965912
                     _cons |   .0611721   .0131474     4.65   0.000     .0334336    .0889106
--------------------------------------------------------------------------------------------

 ( 1)  Ma2DLnNetProductivityNDP = 1

       F(  1,    17) =    0.21
            Prob > F =    0.6513

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      28.01
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8783
                                                Root MSE          =     .00923

--------------------------------------------------------------------------------------------
                           |               Robust
Ma2DLnRealAverageCompens~n | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma2DLnNetProductivityNDP |   1.627444   .2151564     7.56   0.000     1.173504    2.081385
 Ma2UnemploymentRestricted |   .3873002   .4097259     0.95   0.358    -.4771458    1.251746
Ma2LUnemploymentRestricted |  -1.165631   .4062001    -2.87   0.011    -2.022638   -.3086236
           Ma2CPIInflation |  -1.030804   .2687934    -3.83   0.001    -1.597909   -.4636994
                     _cons |   .0614608   .0100832     6.10   0.000     .0401871    .0827346
--------------------------------------------------------------------------------------------

 ( 1)  Ma2DLnNetProductivityNDP = 1

       F(  1,    17) =    8.50
            Prob > F =    0.0096

. 
. foreach var of varlist Ma4DLnRealMedianWage Ma4DLnRealAverageWage Ma4DLnRealAverageCompensation {
  2.         reg `var' Ma4DLnNetProductivityNDP Ma4UnemploymentRestricted Ma4LUnemploymentRestricted Ma4CPIInflation, robust
  3.         test Ma4DLnNetProductivityNDP = 1
  4. }

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      86.32
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9297
                                                Root MSE          =     .00465

--------------------------------------------------------------------------------------------
                           |               Robust
      Ma4DLnRealMedianWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma4DLnNetProductivityNDP |   1.164519   .1044117    11.15   0.000     .9442295    1.384809
 Ma4UnemploymentRestricted |   .5121748   .3900014     1.31   0.207    -.3106563    1.335006
Ma4LUnemploymentRestricted |  -1.056511   .3612261    -2.92   0.009    -1.818631   -.2943903
           Ma4CPIInflation |  -1.073153   .2534098    -4.23   0.001    -1.607801   -.5385046
                     _cons |   .0526186   .0090919     5.79   0.000     .0334364    .0718009
--------------------------------------------------------------------------------------------

 ( 1)  Ma4DLnNetProductivityNDP = 1

       F(  1,    17) =    2.48
            Prob > F =    0.1335

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      70.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9081
                                                Root MSE          =     .00633

--------------------------------------------------------------------------------------------
                           |               Robust
     Ma4DLnRealAverageWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma4DLnNetProductivityNDP |   1.551651   .1421768    10.91   0.000     1.251684    1.851618
 Ma4UnemploymentRestricted |   1.013456   .4463583     2.27   0.036     .0717221     1.95519
Ma4LUnemploymentRestricted |  -1.427409    .411021    -3.47   0.003    -2.294587   -.5602302
           Ma4CPIInflation |  -1.126996   .3540803    -3.18   0.005     -1.87404   -.3799515
                     _cons |   .0461021   .0124168     3.71   0.002      .019905    .0722992
--------------------------------------------------------------------------------------------

 ( 1)  Ma4DLnNetProductivityNDP = 1

       F(  1,    17) =   15.05
            Prob > F =    0.0012

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      87.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9505
                                                Root MSE          =     .00558

--------------------------------------------------------------------------------------------
                           |               Robust
Ma4DLnRealAverageCompens~n | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma4DLnNetProductivityNDP |    1.89195   .1235198    15.32   0.000     1.631346    2.152554
 Ma4UnemploymentRestricted |   1.018778   .3542613     2.88   0.010     .2713521    1.766204
Ma4LUnemploymentRestricted |  -1.677686   .3217108    -5.21   0.000    -2.356436   -.9989352
           Ma4CPIInflation |  -1.112437   .2486683    -4.47   0.000    -1.637082    -.587793
                     _cons |   .0562923   .0077453     7.27   0.000      .039951    .0726335
--------------------------------------------------------------------------------------------

 ( 1)  Ma4DLnNetProductivityNDP = 1

       F(  1,    17) =   52.14
            Prob > F =    0.0000

. 
. foreach var of varlist Ma5DLnRealMedianWage Ma5DLnRealAverageWage Ma5DLnRealAverageCompensation {
  2.         reg `var' Ma5DLnNetProductivityNDP Ma5UnemploymentRestricted Ma5LUnemploymentRestricted Ma5CPIInflation, robust
  3.         test Ma5DLnNetProductivityNDP = 1
  4. }

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =     104.35
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9499
                                                Root MSE          =     .00382

--------------------------------------------------------------------------------------------
                           |               Robust
      Ma5DLnRealMedianWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma5DLnNetProductivityNDP |   1.212053   .0944686    12.83   0.000     1.012741    1.411364
 Ma5UnemploymentRestricted |   .6717671   .3144512     2.14   0.047     .0083332    1.335201
Ma5LUnemploymentRestricted |  -1.157962   .3233821    -3.58   0.002    -1.840239   -.4756856
           Ma5CPIInflation |  -1.115141    .339385    -3.29   0.004     -1.83118   -.3991009
                     _cons |   .0505851   .0105936     4.78   0.000     .0282345    .0729358
--------------------------------------------------------------------------------------------

 ( 1)  Ma5DLnNetProductivityNDP = 1

       F(  1,    17) =    5.04
            Prob > F =    0.0384

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      73.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9319
                                                Root MSE          =     .00539

--------------------------------------------------------------------------------------------
                           |               Robust
     Ma5DLnRealAverageWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma5DLnNetProductivityNDP |   1.601155   .1311407    12.21   0.000     1.324472    1.877838
 Ma5UnemploymentRestricted |    1.23627   .4264316     2.90   0.010     .3365779    2.135962
Ma5LUnemploymentRestricted |  -1.540309   .4306939    -3.58   0.002    -2.448994    -.631624
           Ma5CPIInflation |  -1.267492   .4691495    -2.70   0.015    -2.257311    -.277673
                     _cons |   .0442104   .0153481     2.88   0.010     .0118286    .0765921
--------------------------------------------------------------------------------------------

 ( 1)  Ma5DLnNetProductivityNDP = 1

       F(  1,    17) =   21.01
            Prob > F =    0.0003

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =     130.84
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9640
                                                Root MSE          =     .00471

--------------------------------------------------------------------------------------------
                           |               Robust
Ma5DLnRealAverageCompens~n | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma5DLnNetProductivityNDP |   1.930332   .1032333    18.70   0.000     1.712528    2.148135
 Ma5UnemploymentRestricted |   1.219697   .3291321     3.71   0.002     .5252894    1.914105
Ma5LUnemploymentRestricted |  -1.834898   .2932804    -6.26   0.000    -2.453666   -1.216131
           Ma5CPIInflation |  -1.206203   .3501421    -3.44   0.003    -1.944938   -.4674673
                     _cons |    .056619   .0088691     6.38   0.000     .0379068    .0753313
--------------------------------------------------------------------------------------------

 ( 1)  Ma5DLnNetProductivityNDP = 1

       F(  1,    17) =   81.21
            Prob > F =    0.0000

. 
end of do-file

. do "C:\Users\Admin\AppData\Local\Temp\STD6554_000000.tmp"

. foreach var of varlist Ma3DLnNetProductivityNVA Ma3DLnGrossProductivityGVA Ma3DLnGrossProductivityGDP {
  2.         display "-------------------`var'"
  3.         //Median
.         reg Ma3DLnRealMedianWage `var' Ma3UnemploymentRestricted Ma3LUnemploymentRestricted Ma3CPIInflation, robust
  4.         test `var' = 1
  5.         
.         //Mean Wage
. reg Ma3DLnRealAverageWage `var' Ma3UnemploymentRestricted Ma3LUnemploymentRestricted Ma3CPIInflation, robust
  6.         test `var' = 1
  7.         
.         //Mean Comp
. reg Ma3DLnRealAverageCompensation `var' Ma3UnemploymentRestricted Ma3LUnemploymentRestricted Ma3CPIInflation, robust
  8.         test `var' = 1
  9. }
-------------------Ma3DLnNetProductivityNVA

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      69.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9166
                                                Root MSE          =     .00522

--------------------------------------------------------------------------------------------
                           |               Robust
      Ma3DLnRealMedianWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma3DLnNetProductivityNVA |    1.17998   .1224604     9.64   0.000     .9216111    1.438349
 Ma3UnemploymentRestricted |   .6059034   .3636916     1.67   0.114    -.1614187    1.373226
Ma3LUnemploymentRestricted |  -.9291677   .3324435    -2.79   0.012    -1.630562   -.2277733
           Ma3CPIInflation |  -1.046695   .2323704    -4.50   0.000    -1.536953   -.5564361
                     _cons |   .0423757     .01012     4.19   0.001     .0210244     .063727
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNVA = 1

       F(  1,    17) =    2.16
            Prob > F =    0.1599

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      53.84
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8940
                                                Root MSE          =      .0069

--------------------------------------------------------------------------------------------
                           |               Robust
     Ma3DLnRealAverageWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma3DLnNetProductivityNVA |   1.587331   .1741108     9.12   0.000     1.219989    1.954672
 Ma3UnemploymentRestricted |   1.162745   .4158423     2.80   0.012     .2853949    2.040096
Ma3LUnemploymentRestricted |  -1.309745   .3778289    -3.47   0.003    -2.106895    -.512596
           Ma3CPIInflation |  -1.032731   .2578286    -4.01   0.001    -1.576702   -.4887606
                     _cons |    .032224   .0127091     2.54   0.021     .0054102    .0590379
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNVA = 1

       F(  1,    17) =   11.38
            Prob > F =    0.0036

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      70.25
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9299
                                                Root MSE          =     .00674

--------------------------------------------------------------------------------------------
                           |               Robust
Ma3DLnRealAverageCompens~n | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma3DLnNetProductivityNVA |   1.950114    .176384    11.06   0.000     1.577976    2.322252
 Ma3UnemploymentRestricted |   1.041066   .3085956     3.37   0.004     .3899867    1.692146
Ma3LUnemploymentRestricted |  -1.339028   .2950004    -4.54   0.000    -1.961425   -.7166319
           Ma3CPIInflation |  -.9052811   .2432718    -3.72   0.002     -1.41854   -.3920225
                     _cons |   .0346901   .0092932     3.73   0.002     .0150832    .0542971
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNVA = 1

       F(  1,    17) =   29.02
            Prob > F =    0.0000
-------------------Ma3DLnGrossProductivityGVA

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      73.23
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9329
                                                Root MSE          =     .00468

--------------------------------------------------------------------------------------------
                           |               Robust
      Ma3DLnRealMedianWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
Ma3DLnGrossProductivityGVA |   1.220013   .1191503    10.24   0.000     .9686275    1.471398
 Ma3UnemploymentRestricted |   .1720844   .3242745     0.53   0.603     -.512075    .8562439
Ma3LUnemploymentRestricted |  -.4422945   .3059802    -1.45   0.167    -1.087856    .2032673
           Ma3CPIInflation |  -.8561094   .2105742    -4.07   0.001    -1.300382   -.4118367
                     _cons |   .0322168   .0097729     3.30   0.004     .0115979    .0528358
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnGrossProductivityGVA = 1

       F(  1,    17) =    3.41
            Prob > F =    0.0823

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      88.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9267
                                                Root MSE          =     .00574

--------------------------------------------------------------------------------------------
                           |               Robust
     Ma3DLnRealAverageWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
Ma3DLnGrossProductivityGVA |   1.657197   .1537204    10.78   0.000     1.332875    1.981519
 Ma3UnemploymentRestricted |   .5947152    .340146     1.75   0.098    -.1229301    1.312361
Ma3LUnemploymentRestricted |  -.6638574   .3203997    -2.07   0.054    -1.339842     .012127
           Ma3CPIInflation |  -.7746018   .2260528    -3.43   0.003    -1.251532   -.2976721
                     _cons |   .0180408   .0123146     1.46   0.161    -.0079409    .0440224
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnGrossProductivityGVA = 1

       F(  1,    17) =   18.28
            Prob > F =    0.0005

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =     104.33
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9437
                                                Root MSE          =     .00604

--------------------------------------------------------------------------------------------
                           |               Robust
Ma3DLnRealAverageCompens~n | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
Ma3DLnGrossProductivityGVA |   2.001464   .1612191    12.41   0.000     1.661321    2.341606
 Ma3UnemploymentRestricted |   .3097246   .2217951     1.40   0.181    -.1582221    .7776713
Ma3LUnemploymentRestricted |  -.5260063   .2152428    -2.44   0.026    -.9801288   -.0718838
           Ma3CPIInflation |  -.5919262   .2009771    -2.95   0.009    -1.015951   -.1679017
                     _cons |   .0183794   .0081724     2.25   0.038     .0011373    .0356216
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnGrossProductivityGVA = 1

       F(  1,    17) =   38.59
            Prob > F =    0.0000
-------------------Ma3DLnGrossProductivityGDP

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      55.25
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9019
                                                Root MSE          =     .00566

--------------------------------------------------------------------------------------------
                           |               Robust
      Ma3DLnRealMedianWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
Ma3DLnGrossProductivityGDP |   1.107868   .1268493     8.73   0.000     .8402391    1.375496
 Ma3UnemploymentRestricted |   .0985337   .4417821     0.22   0.826    -.8335451    1.030612
Ma3LUnemploymentRestricted |  -.5974347   .4027022    -1.48   0.156    -1.447062    .2521928
           Ma3CPIInflation |  -.9933491   .2584443    -3.84   0.001    -1.538619   -.4480792
                     _cons |   .0471799   .0111929     4.22   0.001     .0235649    .0707948
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnGrossProductivityGDP = 1

       F(  1,    17) =    0.72
            Prob > F =    0.4069

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      69.84
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8971
                                                Root MSE          =      .0068

--------------------------------------------------------------------------------------------
                           |               Robust
     Ma3DLnRealAverageWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
Ma3DLnGrossProductivityGDP |   1.521487   .1584213     9.60   0.000     1.187247    1.855726
 Ma3UnemploymentRestricted |   .5114791   .4628802     1.10   0.285    -.4651128    1.488071
Ma3LUnemploymentRestricted |  -.8872775   .4326039    -2.05   0.056    -1.799992    .0254369
           Ma3CPIInflation |  -.9610783   .2831095    -3.39   0.003    -1.558387   -.3637694
                     _cons |   .0379989   .0135125     2.81   0.012       .00949    .0665077
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnGrossProductivityGDP = 1

       F(  1,    17) =   10.84
            Prob > F =    0.0043

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      73.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9409
                                                Root MSE          =     .00619

--------------------------------------------------------------------------------------------
                           |               Robust
Ma3DLnRealAverageCompens~n | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
Ma3DLnGrossProductivityGDP |   1.881643   .1416645    13.28   0.000     1.582757     2.18053
 Ma3UnemploymentRestricted |   .2534135   .3034696     0.84   0.415    -.3868515    .8936784
Ma3LUnemploymentRestricted |  -.8294872   .3004135    -2.76   0.013    -1.463304   -.1956702
           Ma3CPIInflation |  -.8172949   .2532113    -3.23   0.005    -1.351524   -.2830658
                     _cons |   .0415106   .0098942     4.20   0.001     .0206356    .0623856
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnGrossProductivityGDP = 1

       F(  1,    17) =   38.73
            Prob > F =    0.0000

. 
end of do-file

. do "C:\Users\Admin\AppData\Local\Temp\STD6554_000000.tmp"

. foreach var of varlist Ma3DLnRealMedianWage Ma3DLnRealAverageWage Ma3DLnRealAverageCompensation {
  2.         reg `var' Ma3DLnNetProductivityNDP Ma3UnemploymentUnrestricted Ma3LUnemploymentUnrestricted Ma3CPIInflation, robust
  3.         test Ma3DLnNetProductivityNDP = 1
  4. }

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      51.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8908
                                                Root MSE          =     .00598

----------------------------------------------------------------------------------------------
                             |               Robust
        Ma3DLnRealMedianWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------------+----------------------------------------------------------------
    Ma3DLnNetProductivityNDP |   .9564681   .1392677     6.87   0.000      .662639    1.250297
 Ma3UnemploymentUnrestricted |   .3666628   .3952235     0.93   0.367    -.4671858    1.200511
Ma3LUnemploymentUnrestricted |  -.8887747   .3495205    -2.54   0.021    -1.626198   -.1513509
             Ma3CPIInflation |  -1.144593   .2703464    -4.23   0.001    -1.714974   -.5742123
                       _cons |   .0621249   .0113699     5.46   0.000     .0381366    .0861133
----------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP = 1

       F(  1,    17) =    0.10
            Prob > F =    0.7584

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      46.36
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8719
                                                Root MSE          =     .00758

----------------------------------------------------------------------------------------------
                             |               Robust
       Ma3DLnRealAverageWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------------+----------------------------------------------------------------
    Ma3DLnNetProductivityNDP |    1.32651   .1851742     7.16   0.000     .9358264    1.717193
 Ma3UnemploymentUnrestricted |   .7728026   .4115544     1.88   0.078    -.0955013    1.641107
Ma3LUnemploymentUnrestricted |  -1.230756   .3821351    -3.22   0.005    -2.036991   -.4245218
             Ma3CPIInflation |  -1.170389    .296163    -3.95   0.001    -1.795238   -.5455393
                       _cons |   .0573938     .01374     4.18   0.001     .0284049    .0863827
----------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP = 1

       F(  1,    17) =    3.11
            Prob > F =    0.0958

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      59.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9244
                                                Root MSE          =       .007

----------------------------------------------------------------------------------------------
                             |               Robust
Ma3DLnRealAverageCompensat~n | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------------+----------------------------------------------------------------
    Ma3DLnNetProductivityNDP |   1.682407   .1642211    10.24   0.000     1.335931    2.028884
 Ma3UnemploymentUnrestricted |   .7020028   .3232874     2.17   0.044      .019926     1.38408
Ma3LUnemploymentUnrestricted |  -1.316236   .3116988    -4.22   0.001    -1.973863   -.6586091
             Ma3CPIInflation |  -1.095543   .3010306    -3.64   0.002    -1.730662   -.4604237
                       _cons |    .063307   .0113594     5.57   0.000     .0393407    .0872733
----------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP = 1

       F(  1,    17) =   17.27
            Prob > F =    0.0007

. 
end of do-file

. do "C:\Users\Admin\AppData\Local\Temp\STD6554_000000.tmp"

. foreach var of varlist Ma3DLnRealMedianWage Ma3DLnRealAverageWage Ma3DLnRealAverageCompensation {
  2.         reg `var' Ma3DLnNetProductivityNDP Ma3UnemploymentRestricted Ma3LUnemploymentRestricted Ma3CPIHInflation, robust
  3.         test Ma3DLnNetProductivityNDP = 1
  4. }

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      26.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8212
                                                Root MSE          =     .00765

--------------------------------------------------------------------------------------------
                           |               Robust
      Ma3DLnRealMedianWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma3DLnNetProductivityNDP |   .8303532     .19125     4.34   0.000      .426851    1.233856
 Ma3UnemploymentRestricted |   1.079317   .6679605     1.62   0.125    -.3299565     2.48859
Ma3LUnemploymentRestricted |  -1.579594   .6224841    -2.54   0.021    -2.892921   -.2662676
          Ma3CPIHInflation |  -1.484172   .4640606    -3.20   0.005    -2.463254   -.5050894
                     _cons |   .0552267   .0145481     3.80   0.001     .0245328    .0859206
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP = 1

       F(  1,    17) =    0.79
            Prob > F =    0.3874

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      21.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7966
                                                Root MSE          =     .00956

--------------------------------------------------------------------------------------------
                           |               Robust
     Ma3DLnRealAverageWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma3DLnNetProductivityNDP |   1.227599   .2355145     5.21   0.000     .7307073    1.724491
 Ma3UnemploymentRestricted |   1.420126   .7280574     1.95   0.068    -.1159403    2.956193
Ma3LUnemploymentRestricted |  -1.861379   .7077454    -2.63   0.018    -3.354591   -.3681666
          Ma3CPIHInflation |  -1.321773   .5269978    -2.51   0.023    -2.433641   -.2099047
                     _cons |   .0472092   .0176706     2.67   0.016     .0099274     .084491
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP = 1

       F(  1,    17) =    0.93
            Prob > F =    0.3474

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      57.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8883
                                                Root MSE          =      .0085

--------------------------------------------------------------------------------------------
                           |               Robust
Ma3DLnRealAverageCompens~n | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma3DLnNetProductivityNDP |   1.604362   .2016544     7.96   0.000     1.178908    2.029816
 Ma3UnemploymentRestricted |   1.354311   .5451219     2.48   0.024     .2042044    2.504418
Ma3LUnemploymentRestricted |  -2.000079   .5478478    -3.65   0.002    -3.155937   -.8442212
          Ma3CPIHInflation |  -1.312202   .4549602    -2.88   0.010    -2.272084   -.3523198
                     _cons |   .0550558   .0145587     3.78   0.001     .0243397    .0857719
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP = 1

       F(  1,    17) =    8.98
            Prob > F =    0.0081

. 
end of do-file

. ardl DLnRealMedianWage DLnNetProductivityNDP UnemploymentRestricted CPIInflation, maxlags(1,3,3,3) bic

ARDL(1,3,2,1) regression

Sample: 2001 thru 2019                                  Number of obs =     19
                                                        F(10, 8)      =  31.70
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.9754
                                                        Adj R-squared = 0.9446
Log likelihood = 83.772432                              Root MSE      = 0.0045

----------------------------------------------------------------------------------------
     DLnRealMedianWage | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
     DLnRealMedianWage |
                   L1. |  -.5905228   .1596921    -3.70   0.006    -.9587734   -.2222722
                       |
 DLnNetProductivityNDP |
                   --. |  -.6931454   .2165343    -3.20   0.013    -1.192474   -.1938165
                   L1. |   .8962285   .1864186     4.81   0.001     .4663464    1.326111
                   L2. |   .5095159   .0940045     5.42   0.001     .2927412    .7262906
                   L3. |    .513915   .1174964     4.37   0.002     .2429679    .7848621
                       |
UnemploymentRestricted |
                   --. |  -1.019728   .3798499    -2.68   0.028    -1.895664   -.1437929
                   L1. |   1.231536   .7438267     1.66   0.136    -.4837309    2.946804
                   L2. |  -1.016631   .4913405    -2.07   0.072    -2.149664    .1164027
                       |
          CPIInflation |
                   --. |  -.6263043   .1684514    -3.72   0.006    -1.014754   -.2378546
                   L1. |  -1.340141   .2665489    -5.03   0.001    -1.954804   -.7254786
                       |
                 _cons |   .0873001   .0132086     6.61   0.000     .0568409    .1177593
----------------------------------------------------------------------------------------

. ardl DLnRealMedianWage DLnNetProductivityNDP UnemploymentRestricted CPIInflation, maxlags(3,3,3,3) bic

ARDL(3,3,3,3) regression

Sample: 2001 thru 2019                                  Number of obs =     19
                                                        F(15, 3)      =  60.81
                                                        Prob > F      = 0.0030
                                                        R-squared     = 0.9967
                                                        Adj R-squared = 0.9803
Log likelihood = 102.92573                              Root MSE      = 0.0027

----------------------------------------------------------------------------------------
     DLnRealMedianWage | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
     DLnRealMedianWage |
                   L1. |  -.6786218   .3275733    -2.07   0.130    -1.721106    .3638628
                   L2. |  -.7919141    .197421    -4.01   0.028    -1.420196   -.1636322
                   L3. |  -.7569194   .3116888    -2.43   0.093    -1.748852    .2350135
                       |
 DLnNetProductivityNDP |
                   --. |  -.2350849   .1804584    -1.30   0.284    -.8093842    .3392143
                   L1. |   1.804935    .398973     4.52   0.020      .535225    3.074645
                   L2. |   .5402802   .3902953     1.38   0.260    -.7018138    1.782374
                   L3. |   .7178132   .1631124     4.40   0.022     .1987168     1.23691
                       |
UnemploymentRestricted |
                   --. |  -.4409925   .4392343    -1.00   0.389    -1.838832    .9568471
                   L1. |   .8947654   .7201546     1.24   0.302    -1.397088    3.186619
                   L2. |   .1816914   .5705748     0.32   0.771    -1.634132    1.997515
                   L3. |  -3.133371   .9967073    -3.14   0.052    -6.305339     .038596
                       |
          CPIInflation |
                   --. |  -1.616963   .3242565    -4.99   0.016    -2.648892   -.5850344
                   L1. |  -2.234508   .4704945    -4.75   0.018    -3.731832   -.7371844
                   L2. |  -.0537865   .3651919    -0.15   0.892     -1.21599    1.108417
                   L3. |  -.8899069   .3792804    -2.35   0.101    -2.096946    .3171325
                       |
                 _cons |    .246245   .0584672     4.21   0.024     .0601762    .4323139
----------------------------------------------------------------------------------------

. test L1.DLnNetProductivityNDP=1

 ( 1)  L.DLnNetProductivityNDP = 1

       F(  1,     3) =    4.07
            Prob > F =    0.1370

. test L3.DLnNetProductivityNDP=1

 ( 1)  L3.DLnNetProductivityNDP = 1

       F(  1,     3) =    2.99
            Prob > F =    0.1821

. ardl DLnRealMedianWage DLnNetProductivityNDP UnemploymentRestricted CPIInflation, maxlags(2,2,2,2) bic

ARDL(2,1,1,2) regression

Sample: 2000 thru 2019                                  Number of obs =     20
                                                        F(9, 10)      =  37.68
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.9714
                                                        Adj R-squared = 0.9456
Log likelihood = 86.630114                              Root MSE      = 0.0045

----------------------------------------------------------------------------------------
     DLnRealMedianWage | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
     DLnRealMedianWage |
                   L1. |   .1129376   .1192729     0.95   0.366     -.152819    .3786942
                   L2. |   -.230143   .1345749    -1.71   0.118    -.5299945    .0697085
                       |
 DLnNetProductivityNDP |
                   --. |  -.0098098   .2159941    -0.05   0.965    -.4910745    .4714549
                   L1. |   1.060127   .1768345     6.00   0.000     .6661153    1.454139
                       |
UnemploymentRestricted |
                   --. |   .3392798   .3149978     1.08   0.307    -.3625791    1.041139
                   L1. |  -1.119849   .3886749    -2.88   0.016     -1.98587   -.2538268
                       |
          CPIInflation |
                   --. |  -.5605748   .1251449    -4.48   0.001     -.839415   -.2817346
                   L1. |  -.7917332   .2540903    -3.12   0.011    -1.357882   -.2255847
                   L2. |   .7181769   .1388118     5.17   0.000     .4088849    1.027469
                       |
                 _cons |   .0516982   .0105535     4.90   0.001     .0281836    .0752128
----------------------------------------------------------------------------------------

. ardl DLnRealAverageWage DLnNetProductivityNDP UnemploymentRestricted CPIInflation, maxlags(2,2,2,2) bic

ARDL(1,1,1,2) regression

Sample: 2000 thru 2019                                  Number of obs =     20
                                                        F(8, 11)      =  23.36
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.9444
                                                        Adj R-squared = 0.9040
Log likelihood = 79.288814                              Root MSE      = 0.0062

----------------------------------------------------------------------------------------
    DLnRealAverageWage | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
    DLnRealAverageWage |
                   L1. |   .2262262   .1564218     1.45   0.176    -.1180559    .5705084
                       |
 DLnNetProductivityNDP |
                   --. |  -.2060129   .2471464    -0.83   0.422    -.7499783    .3379526
                   L1. |   1.072222   .2460617     4.36   0.001     .5306439      1.6138
                       |
UnemploymentRestricted |
                   --. |   .1277934   .3634647     0.35   0.732     -.672187    .9277737
                   L1. |  -.6227744   .4276121    -1.46   0.173    -1.563942    .3183936
                       |
          CPIInflation |
                   --. |  -.4199475   .1669327    -2.52   0.029    -.7873639   -.0525311
                   L1. |  -.8528236    .310945    -2.74   0.019    -1.537209   -.1684382
                   L2. |   .7263408   .1582286     4.59   0.001      .378082      1.0746
                       |
                 _cons |   .0352598   .0128395     2.75   0.019     .0070002    .0635194
----------------------------------------------------------------------------------------

. ardl DLnRealAverageCompensation DLnNetProductivityNDP UnemploymentRestricted CPIInflation, maxlags(2,2,2,2) bic

ARDL(2,1,1,2) regression

Sample: 2000 thru 2019                                  Number of obs =     20
                                                        F(9, 10)      =  11.31
                                                        Prob > F      = 0.0004
                                                        R-squared     = 0.9105
                                                        Adj R-squared = 0.8300
Log likelihood = 70.216172                              Root MSE      = 0.0102

--------------------------------------------------------------------------------------------
DLnRealAverageCompensation | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
DLnRealAverageCompensation |
                       L1. |   -.052139   .2248624    -0.23   0.821    -.5531636    .4488856
                       L2. |  -.4203359   .2222643    -1.89   0.088    -.9155717    .0748998
                           |
     DLnNetProductivityNDP |
                       --. |   1.267528   .4416093     2.87   0.017     .2835613    2.251495
                       L1. |   1.449786   .5490959     2.64   0.025     .2263238    2.673248
                           |
    UnemploymentRestricted |
                       --. |    1.87675   .7728892     2.43   0.036     .1546459    3.598855
                       L1. |  -2.907165   .9065774    -3.21   0.009    -4.927146   -.8871852
                           |
              CPIInflation |
                       --. |  -.8571168   .3203816    -2.68   0.023    -1.570972   -.1432621
                       L1. |  -.5224552   .5901773    -0.89   0.397    -1.837452    .7925417
                       L2. |   .5758793   .3004386     1.92   0.084    -.0935396    1.245298
                           |
                     _cons |   .0626944   .0179001     3.50   0.006     .0228105    .1025782
--------------------------------------------------------------------------------------------

. do "C:\Users\Admin\AppData\Local\Temp\STD6554_000000.tmp"

. //Income Dist.
. foreach var of varlist P I J K L M N O {
  2.         display "`var'-------------------"
  3.         reg Ma3DLn`var' Ma3DLnNetProductivityNDP Ma3UnemploymentRestricted Ma3LUnemploymentRestricted Ma3CPIInflation, robust
  4.         test Ma3DLnNetProductivityNDP = 1
  5. }
P-------------------

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      61.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8878
                                                Root MSE          =     .00686

--------------------------------------------------------------------------------------------
                           |               Robust
                   Ma3DLnP | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma3DLnNetProductivityNDP |   .8778323   .1809482     4.85   0.000     .4960649      1.2596
 Ma3UnemploymentRestricted |  -.9499509   .3800802    -2.50   0.023     -1.75185   -.1480518
Ma3LUnemploymentRestricted |   .1039897   .3719148     0.28   0.783     -.680682    .8886614
           Ma3CPIInflation |  -1.052079   .2222638    -4.73   0.000    -1.521014   -.5831429
                     _cons |   .0743518   .0111588     6.66   0.000     .0508087    .0978948
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP = 1

       F(  1,    17) =    0.46
            Prob > F =    0.5087
I-------------------

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      73.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9203
                                                Root MSE          =     .00522

--------------------------------------------------------------------------------------------
                           |               Robust
                   Ma3DLnI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma3DLnNetProductivityNDP |   .8379189   .1249354     6.71   0.000     .5743283    1.101509
 Ma3UnemploymentRestricted |  -.3968024   .3660552    -1.08   0.294    -1.169111    .3755065
Ma3LUnemploymentRestricted |  -.4094812   .3264853    -1.25   0.227    -1.098305    .2793426
           Ma3CPIInflation |  -1.127766   .1942911    -5.80   0.000    -1.537685   -.7178477
                     _cons |   .0712658   .0078967     9.02   0.000     .0546051    .0879265
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP = 1

       F(  1,    17) =    1.68
            Prob > F =    0.2119
J-------------------

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      62.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9115
                                                Root MSE          =     .00538

--------------------------------------------------------------------------------------------
                           |               Robust
                   Ma3DLnJ | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma3DLnNetProductivityNDP |    .971214   .1208544     8.04   0.000     .7162336    1.226194
 Ma3UnemploymentRestricted |   .0688017   .3992728     0.17   0.865    -.7735903    .9111936
Ma3LUnemploymentRestricted |  -.7483723   .3557715    -2.10   0.051    -1.498985    .0022399
           Ma3CPIInflation |  -1.124812   .2333458    -4.82   0.000    -1.617128   -.6324949
                     _cons |   .0623435   .0095133     6.55   0.000     .0422721    .0824148
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP = 1

       F(  1,    17) =    0.06
            Prob > F =    0.8146
K-------------------

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      50.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8797
                                                Root MSE          =     .00625

--------------------------------------------------------------------------------------------
                           |               Robust
                   Ma3DLnK | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma3DLnNetProductivityNDP |   1.021792   .1405887     7.27   0.000     .7251758    1.318408
 Ma3UnemploymentRestricted |    .197285   .4736877     0.42   0.682    -.8021086    1.196679
Ma3LUnemploymentRestricted |  -.8147234   .4226923    -1.93   0.071    -1.706526    .0770793
           Ma3CPIInflation |  -1.051587   .2669509    -3.94   0.001    -1.614804   -.4883693
                     _cons |   .0564676   .0111443     5.07   0.000     .0329551    .0799801
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP = 1

       F(  1,    17) =    0.02
            Prob > F =    0.8786
L-------------------

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      50.02
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8695
                                                Root MSE          =     .00663

--------------------------------------------------------------------------------------------
                           |               Robust
                   Ma3DLnL | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma3DLnNetProductivityNDP |   1.128896   .1491752     7.57   0.000     .8141637    1.443628
 Ma3UnemploymentRestricted |   .6119943   .5266596     1.16   0.261    -.4991603    1.723149
Ma3LUnemploymentRestricted |  -1.157106   .4687355    -2.47   0.024    -2.146051   -.1681604
           Ma3CPIInflation |  -1.114315   .2900591    -3.84   0.001    -1.726287   -.5023443
                     _cons |   .0542357   .0123127     4.40   0.000     .0282582    .0802132
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP = 1

       F(  1,    17) =    0.75
            Prob > F =    0.3996
M-------------------

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      52.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8713
                                                Root MSE          =      .0069

--------------------------------------------------------------------------------------------
                           |               Robust
                   Ma3DLnM | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma3DLnNetProductivityNDP |   1.229488   .1582562     7.77   0.000     .8955968     1.56338
 Ma3UnemploymentRestricted |   .7117192   .5314956     1.34   0.198    -.4096386    1.833077
Ma3LUnemploymentRestricted |  -1.262911   .4749152    -2.66   0.017    -2.264894   -.2609272
           Ma3CPIInflation |  -1.100494   .2920242    -3.77   0.002    -1.716612   -.4843771
                     _cons |   .0536024   .0127311     4.21   0.001     .0267421    .0804626
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP = 1

       F(  1,    17) =    2.10
            Prob > F =    0.1652
N-------------------

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      66.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8986
                                                Root MSE          =     .00634

--------------------------------------------------------------------------------------------
                           |               Robust
                   Ma3DLnN | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma3DLnNetProductivityNDP |   1.292137   .1457651     8.86   0.000     .9845994    1.599674
 Ma3UnemploymentRestricted |   .9280791   .4995922     1.86   0.081    -.1259683    1.982127
Ma3LUnemploymentRestricted |  -1.500999   .4466516    -3.36   0.004    -2.443351   -.5586462
           Ma3CPIInflation |  -1.230877   .2665994    -4.62   0.000    -1.793353   -.6684015
                     _cons |   .0574551    .011888     4.83   0.000     .0323735    .0825367
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP = 1

       F(  1,    17) =    4.02
            Prob > F =    0.0613
O-------------------

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      82.43
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9200
                                                Root MSE          =     .00605

--------------------------------------------------------------------------------------------
                           |               Robust
                   Ma3DLnO | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma3DLnNetProductivityNDP |   1.373735    .139511     9.85   0.000     1.079393    1.668078
 Ma3UnemploymentRestricted |   .9538669   .4177774     2.28   0.036     .0724335      1.8353
Ma3LUnemploymentRestricted |  -1.631596   .3815334    -4.28   0.001    -2.436561   -.8266307
           Ma3CPIInflation |  -1.328372   .2414954    -5.50   0.000    -1.837883   -.8188614
                     _cons |   .0646343   .0108012     5.98   0.000     .0418457     .087423
--------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP = 1

       F(  1,    17) =    7.18
            Prob > F =    0.0159

. 
end of do-file

. test Ma3DLnNetProductivityNDP=2

 ( 1)  Ma3DLnNetProductivityNDP = 2

       F(  1,    17) =   20.15
            Prob > F =    0.0003

. do "C:\Users\Admin\AppData\Local\Temp\STD6554_000000.tmp"

. //Contemp. w/o inflation
. foreach var of varlist DLnRealMedianWage DLnRealAverageWage DLnRealAverageCompensation {
  2.         reg `var' DLnNetProductivityNDP UnemploymentRestricted L.UnemploymentRestricted, robust
  3.         test DLnNetProductivityNDP = 1
  4. }

Linear regression                               Number of obs     =         22
                                                F(3, 18)          =       3.78
                                                Prob > F          =     0.0290
                                                R-squared         =     0.3594
                                                Root MSE          =     .01656

----------------------------------------------------------------------------------------
                       |               Robust
     DLnRealMedianWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
 DLnNetProductivityNDP |   .3203026   .2292875     1.40   0.179    -.1614126    .8020177
                       |
UnemploymentRestricted |
                   --. |  -.2455814   .7757338    -0.32   0.755    -1.875338    1.384175
                   L1. |  -.7787912   .6680244    -1.17   0.259    -2.182259     .624676
                       |
                 _cons |   .0530591    .019323     2.75   0.013      .012463    .0936551
----------------------------------------------------------------------------------------

 ( 1)  DLnNetProductivityNDP = 1

       F(  1,    18) =    8.79
            Prob > F =    0.0083

Linear regression                               Number of obs     =         22
                                                F(3, 18)          =       5.95
                                                Prob > F          =     0.0053
                                                R-squared         =     0.3910
                                                Root MSE          =     .01723

----------------------------------------------------------------------------------------
                       |               Robust
    DLnRealAverageWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
 DLnNetProductivityNDP |   .5430412   .2550212     2.13   0.047     .0072616    1.078821
                       |
UnemploymentRestricted |
                   --. |   -.000336   .7963816    -0.00   1.000    -1.673472      1.6728
                   L1. |  -1.011097   .7293226    -1.39   0.183    -2.543347    .5211524
                       |
                 _cons |   .0520582   .0177798     2.93   0.009     .0147042    .0894121
----------------------------------------------------------------------------------------

 ( 1)  DLnNetProductivityNDP = 1

       F(  1,    18) =    3.21
            Prob > F =    0.0900

Linear regression                               Number of obs     =         22
                                                F(3, 18)          =      11.57
                                                Prob > F          =     0.0002
                                                R-squared         =     0.5480
                                                Root MSE          =     .01875

----------------------------------------------------------------------------------------
                       |               Robust
DLnRealAverageCompen~n | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
 DLnNetProductivityNDP |   1.164452   .3394193     3.43   0.003     .4513586    1.877545
                       |
UnemploymentRestricted |
                   --. |   .3377525   .9961099     0.34   0.738    -1.754997    2.430502
                   L1. |   -1.38516   .8445027    -1.64   0.118    -3.159395    .3890739
                       |
                 _cons |   .0505565   .0178762     2.83   0.011         .013     .088113
----------------------------------------------------------------------------------------

 ( 1)  DLnNetProductivityNDP = 1

       F(  1,    18) =    0.23
            Prob > F =    0.6339

. 
end of do-file

. do "C:\Users\Admin\AppData\Local\Temp\STD6554_000000.tmp"

. foreach var of varlist P I J K L M N O {
  2.         display "`var'-------------------"
  3.         reg Ma3DLn`var' Ma3DLnNetProductivityNDP Ma3UnemploymentRestricted Ma3LUnemploymentRestricted Ma3CPIInflation dummy_Ma3DLnNetProductivityNDP, robust
  4.         test Ma3DLnNetProductivityNDP + dummy_Ma3DLnNetProductivityNDP = 1
  5. }
P-------------------

Linear regression                               Number of obs     =         22
                                                F(5, 16)          =      53.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8895
                                                Root MSE          =     .00702

------------------------------------------------------------------------------------------------
                               |               Robust
                       Ma3DLnP | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------------+----------------------------------------------------------------
      Ma3DLnNetProductivityNDP |   .6093624   .5650183     1.08   0.297    -.5884229    1.807148
     Ma3UnemploymentRestricted |  -1.178076   .5184512    -2.27   0.037    -2.277143   -.0790085
    Ma3LUnemploymentRestricted |   .3043002   .4934752     0.62   0.546    -.7418205    1.350421
               Ma3CPIInflation |  -.9575431   .2954469    -3.24   0.005    -1.583863   -.3312237
dummy_Ma3DLnNetProductivityNDP |   .2461664   .5270282     0.47   0.647    -.8710835    1.363416
                         _cons |   .0733902   .0111936     6.56   0.000     .0496608    .0971195
------------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP + dummy_Ma3DLnNetProductivityNDP = 1

       F(  1,    16) =    0.65
            Prob > F =    0.4318
I-------------------

Linear regression                               Number of obs     =         22
                                                F(5, 16)          =      76.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9286
                                                Root MSE          =      .0051

------------------------------------------------------------------------------------------------
                               |               Robust
                       Ma3DLnI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------------+----------------------------------------------------------------
      Ma3DLnNetProductivityNDP |   .2877873   .3980084     0.72   0.480    -.5559527    1.131527
     Ma3UnemploymentRestricted |  -.8642616   .4665068    -1.85   0.082    -1.853212    .1246887
    Ma3LUnemploymentRestricted |   .0009825   .4168975     0.00   0.998    -.8828008    .8847658
               Ma3CPIInflation |  -.9340501    .220843    -4.23   0.001    -1.402216   -.4658839
dummy_Ma3DLnNetProductivityNDP |   .5044288   .3607023     1.40   0.181    -.2602259    1.269083
                         _cons |   .0692953   .0065756    10.54   0.000     .0553557    .0832349
------------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP + dummy_Ma3DLnNetProductivityNDP = 1

       F(  1,    16) =    2.99
            Prob > F =    0.1031
J-------------------

Linear regression                               Number of obs     =         22
                                                F(5, 16)          =      89.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9390
                                                Root MSE          =     .00461

------------------------------------------------------------------------------------------------
                               |               Robust
                       Ma3DLnJ | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------------+----------------------------------------------------------------
      Ma3DLnNetProductivityNDP |  -.0033717   .3694095    -0.01   0.993    -.7864849    .7797415
     Ma3UnemploymentRestricted |  -.7593259   .3997139    -1.90   0.076    -1.606682    .0880297
    Ma3LUnemploymentRestricted |  -.0212152   .3633061    -0.06   0.954    -.7913897    .7489593
               Ma3CPIInflation |  -.7816338   .1981336    -3.94   0.001    -1.201658   -.3616093
dummy_Ma3DLnNetProductivityNDP |    .893621   .3404853     2.62   0.018     .1718244    1.615418
                         _cons |   .0588527   .0057437    10.25   0.000     .0466766    .0710287
------------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP + dummy_Ma3DLnNetProductivityNDP = 1

       F(  1,    16) =    1.28
            Prob > F =    0.2740
K-------------------

Linear regression                               Number of obs     =         22
                                                F(5, 16)          =      69.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9199
                                                Root MSE          =     .00525

------------------------------------------------------------------------------------------------
                               |               Robust
                       Ma3DLnK | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------------+----------------------------------------------------------------
      Ma3DLnNetProductivityNDP |  -.1512407    .430229    -0.35   0.730    -1.063285     .760804
     Ma3UnemploymentRestricted |  -.7994673   .4678983    -1.71   0.107    -1.791367    .1924327
    Ma3LUnemploymentRestricted |   .0604987   .4291795     0.14   0.890    -.8493213    .9703187
               Ma3CPIInflation |  -.6385304   .2289207    -2.79   0.013    -1.123821   -.1532402
dummy_Ma3DLnNetProductivityNDP |   1.075582   .3980947     2.70   0.016     .2316585    1.919505
                         _cons |    .052266   .0065683     7.96   0.000     .0383417    .0661902
------------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP + dummy_Ma3DLnNetProductivityNDP = 1

       F(  1,    16) =    0.48
            Prob > F =    0.4984
L-------------------

Linear regression                               Number of obs     =         22
                                                F(5, 16)          =      94.43
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9263
                                                Root MSE          =     .00514

------------------------------------------------------------------------------------------------
                               |               Robust
                       Ma3DLnL | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------------+----------------------------------------------------------------
      Ma3DLnNetProductivityNDP |  -.2924064   .4178789    -0.70   0.494     -1.17827    .5934573
     Ma3UnemploymentRestricted |  -.5957183   .4704758    -1.27   0.224    -1.593082    .4016458
    Ma3LUnemploymentRestricted |  -.0966451   .4398426    -0.22   0.829     -1.02907    .8357795
               Ma3CPIInflation |  -.6138369   .2394029    -2.56   0.021    -1.121348   -.1063255
dummy_Ma3DLnNetProductivityNDP |   1.303226   .3971607     3.28   0.005     .4612828    2.145169
                         _cons |   .0491448   .0066258     7.42   0.000     .0350987     .063191
------------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP + dummy_Ma3DLnNetProductivityNDP = 1

       F(  1,    16) =    0.01
            Prob > F =    0.9163
M-------------------

Linear regression                               Number of obs     =         22
                                                F(5, 16)          =      68.21
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9178
                                                Root MSE          =     .00568

------------------------------------------------------------------------------------------------
                               |               Robust
                       Ma3DLnM | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------------+----------------------------------------------------------------
      Ma3DLnNetProductivityNDP |  -.1177039   .4375143    -0.27   0.791    -1.045193    .8097851
     Ma3UnemploymentRestricted |  -.4330204   .5145502    -0.84   0.412    -1.523818    .6577773
    Ma3LUnemploymentRestricted |  -.2577448   .4806193    -0.54   0.599    -1.276612    .7611227
               Ma3CPIInflation |   -.626112   .2628725    -2.38   0.030    -1.183377   -.0688472
dummy_Ma3DLnNetProductivityNDP |   1.235273    .423191     2.92   0.010     .3381477    2.132397
                         _cons |    .048777   .0079626     6.13   0.000      .031897     .065657
------------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP + dummy_Ma3DLnNetProductivityNDP = 1

       F(  1,    16) =    1.07
            Prob > F =    0.3168
N-------------------

Linear regression                               Number of obs     =         22
                                                F(5, 16)          =      92.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9421
                                                Root MSE          =     .00494

------------------------------------------------------------------------------------------------
                               |               Robust
                       Ma3DLnN | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------------+----------------------------------------------------------------
      Ma3DLnNetProductivityNDP |  -.0563125   .3829126    -0.15   0.885     -.868051    .7554259
     Ma3UnemploymentRestricted |  -.2177288   .4439596    -0.49   0.630    -1.158881    .7234234
    Ma3LUnemploymentRestricted |  -.4948949   .4169098    -1.19   0.253    -1.378704    .3889143
               Ma3CPIInflation |   -.756052   .2207447    -3.43   0.003     -1.22401   -.2880942
dummy_Ma3DLnNetProductivityNDP |   1.236425   .3644145     3.39   0.004     .4639013     2.00895
                         _cons |   .0526252   .0068814     7.65   0.000     .0380374    .0672131
------------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP + dummy_Ma3DLnNetProductivityNDP = 1

       F(  1,    16) =    3.06
            Prob > F =    0.0996
O-------------------

Linear regression                               Number of obs     =         22
                                                F(5, 16)          =      93.25
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9391
                                                Root MSE          =     .00544

------------------------------------------------------------------------------------------------
                               |               Robust
                       Ma3DLnO | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------------+----------------------------------------------------------------
      Ma3DLnNetProductivityNDP |   .4135745   .4124533     1.00   0.331    -.4607873    1.287936
     Ma3UnemploymentRestricted |   .1379965   .4289964     0.32   0.752    -.7714351    1.047428
    Ma3LUnemploymentRestricted |  -.9152015   .3922243    -2.33   0.033     -1.74668   -.0837231
               Ma3CPIInflation |  -.9902738   .2120576    -4.67   0.000    -1.439816   -.5407319
dummy_Ma3DLnNetProductivityNDP |   .8803944   .3861772     2.28   0.037     .0617353    1.699054
                         _cons |   .0611952   .0072377     8.46   0.000     .0458519    .0765385
------------------------------------------------------------------------------------------------

 ( 1)  Ma3DLnNetProductivityNDP + dummy_Ma3DLnNetProductivityNDP = 1

       F(  1,    16) =    6.31
            Prob > F =    0.0231

. 
end of do-file

. reg Ma3DLnRealMedianWage Ma3DLnNetProductivityNDP Ma3UnemploymentRestricted Ma3LUnemploymentRestricted Ma3CPIInflation if Year < 2008, robust

Linear regression                               Number of obs     =         10
                                                F(4, 5)           =      53.05
                                                Prob > F          =     0.0003
                                                R-squared         =     0.9583
                                                Root MSE          =     .00166

--------------------------------------------------------------------------------------------
                           |               Robust
      Ma3DLnRealMedianWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma3DLnNetProductivityNDP |   .3366253   .8882813     0.38   0.720    -1.946774    2.620025
 Ma3UnemploymentRestricted |    .102516   1.265004     0.08   0.939     -3.14928    3.354312
Ma3LUnemploymentRestricted |   .1804539   1.515122     0.12   0.910     -3.71429    4.075198
           Ma3CPIInflation |  -.9759231   .1370065    -7.12   0.001    -1.328109   -.6237368
                     _cons |   .0286061   .0067189     4.26   0.008     .0113346    .0458775
--------------------------------------------------------------------------------------------

. checkrob
command checkrob is unrecognized
r(199);

. rcheck
command rcheck is unrecognized
r(199);

. rreg Ma3DLnRealMedianWage Ma3DLnNetProductivityNDP Ma3UnemploymentRestricted Ma3LUnemploymentRestricted Ma3CPIInflation

   Huber iteration 1:  Maximum difference in weights = .64391268
   Huber iteration 2:  Maximum difference in weights = .15917959
   Huber iteration 3:  Maximum difference in weights = .04819323
Biweight iteration 4:  Maximum difference in weights = .30064332
Biweight iteration 5:  Maximum difference in weights = .11220886
Biweight iteration 6:  Maximum difference in weights = .08008501
Biweight iteration 7:  Maximum difference in weights = .11642351
Biweight iteration 8:  Maximum difference in weights = .20742249
Biweight iteration 9:  Maximum difference in weights = .09202993
Biweight iteration 10: Maximum difference in weights = .0523096
Biweight iteration 11: Maximum difference in weights = .04308933
Biweight iteration 12: Maximum difference in weights = .02824279
Biweight iteration 13: Maximum difference in weights = .02132296
Biweight iteration 14: Maximum difference in weights = .01586763
Biweight iteration 15: Maximum difference in weights = .01189483
Biweight iteration 16: Maximum difference in weights = .00996705

Robust regression                               Number of obs     =         22
                                                F(  4,        17) =      73.19
                                                Prob > F          =     0.0000

--------------------------------------------------------------------------------------------
      Ma3DLnRealMedianWage | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
  Ma3DLnNetProductivityNDP |   1.129659   .0828073    13.64   0.000     .9549503    1.304367
 Ma3UnemploymentRestricted |   .7194192   .2388278     3.01   0.008     .2155366    1.223302
Ma3LUnemploymentRestricted |  -.9925478     .22874    -4.34   0.000    -1.475147   -.5099486
           Ma3CPIInflation |  -.9184207   .1436359    -6.39   0.000    -1.221466   -.6153754
                     _cons |    .036919   .0051539     7.16   0.000     .0260452    .0477928
--------------------------------------------------------------------------------------------

. clemao1 DLnRealMedianWage

Clemente-Montañés-Reyes unit-root test with single mean shift, AO model

DLnRealMedianWage    T =   20 optimal breakpoint : 2007

AR( 6)               du1            (rho - 1)     const
-------------------------------------------------------------------------
Coefficient:        -0.02277       -2.45043       0.02151
t-statistic:          -3.406         -1.354    
P-value:               0.076         -3.560  (5% crit. value)

. clemao2 DLnRealMedianWage

Clemente-Montañés-Reyes unit-root test with double mean shifts, AO model

DLnRealMedianWage    T =   20 optimal breakpoints : 2007 , 2014

AR( 1)               du1            du2         (rho - 1)       const
-------------------------------------------------------------------------
Coefficients:       -0.03201        0.02218     -1.34651         0.02151
t-statistics:         -4.828          2.816       -5.864
P-values:              0.000          0.012       -5.490 (5% crit. value)

. edit

. clemao1 DLnRealMedianWage

Clemente-Montañés-Reyes unit-root test with single mean shift, AO model

DLnRealMedianWage    T =   20 optimal breakpoint : 2007

AR( 6)               du1            (rho - 1)     const
-------------------------------------------------------------------------
Coefficient:        -0.02277       -2.45043       0.02151
t-statistic:          -3.406         -1.354    
P-value:               0.076         -3.560  (5% crit. value)

. clemio1 DLnRealMedianWage

Clemente-Montañés-Reyes unit-root test with single mean shift, IO model

DLnRealMedianWage    T =   20 optimal breakpoint : 2008

AR( 6)               du1            (rho - 1)     const
-------------------------------------------------------------------------
Coefficient:        -0.04833       -2.23540       0.04232
t-statistic:          -5.149         -6.255    
P-value:               0.004         -4.270  (5% crit. value)

. clemao1 DLnRealAverageWage

Clemente-Montañés-Reyes unit-root test with single mean shift, AO model

DLnRealAverageWage    T =   20 optimal breakpoint : 2005

AR( 0)               du1            (rho - 1)     const
-------------------------------------------------------------------------
Coefficient:        -0.02888       -0.50683       0.02895
t-statistic:          -4.331         -2.423    
P-value:               0.000         -3.560  (5% crit. value)

. clemio1 DLnRealAverageWage

Clemente-Montañés-Reyes unit-root test with single mean shift, IO model

DLnRealAverageWage    T =   20 optimal breakpoint : 2001

AR( 3)               du1            (rho - 1)     const
-------------------------------------------------------------------------
Coefficient:         0.00000       -0.46236       0.00081
t-statistic:               .         -2.650    
P-value:                   .         -4.270  (5% crit. value)

. do "C:\Users\Admin\AppData\Local\Temp\STD6554_000000.tmp"

. foreach var of varlist DLnRealMedianWage DLnRealAverageWage DLnRealAverageCompensation {
  2.         reg `var' DLnNetProductivityNDP UnemploymentRestricted L.UnemploymentRestricted CPIInflation, robust
  3.         test DLnNetProductivityNDP = 1
  4. }

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =       8.85
                                                Prob > F          =     0.0005
                                                R-squared         =     0.7344
                                                Root MSE          =     .01097

----------------------------------------------------------------------------------------
                       |               Robust
     DLnRealMedianWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
 DLnNetProductivityNDP |   .6207991   .1989581     3.12   0.006     .2010342    1.040564
                       |
UnemploymentRestricted |
                   --. |   -.292088   .4880682    -0.60   0.557    -1.321822    .7376459
                   L1. |  -.4843355   .5737072    -0.84   0.410    -1.694752     .726081
                       |
          CPIInflation |  -1.067386   .2398534    -4.45   0.000    -1.573432   -.5613394
                 _cons |   .0674438   .0121812     5.54   0.000     .0417437    .0931439
----------------------------------------------------------------------------------------

 ( 1)  DLnNetProductivityNDP = 1

       F(  1,    17) =    3.63
            Prob > F =    0.0737

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      13.03
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6850
                                                Root MSE          =     .01275

----------------------------------------------------------------------------------------
                       |               Robust
    DLnRealAverageWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
 DLnNetProductivityNDP |   .8270822   .2448329     3.38   0.004     .3105299    1.343634
                       |
UnemploymentRestricted |
                   --. |  -.0442959   .5660392    -0.08   0.939    -1.238534    1.149942
                   L1. |  -.7327666   .6706094    -1.09   0.290    -2.147629    .6820956
                       |
          CPIInflation |  -1.008934   .2561766    -3.94   0.001     -1.54942   -.4684488
                 _cons |   .0656551   .0115204     5.70   0.000     .0413492     .089961
----------------------------------------------------------------------------------------

 ( 1)  DLnNetProductivityNDP = 1

       F(  1,    17) =    0.50
            Prob > F =    0.4896

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      22.64
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7837
                                                Root MSE          =     .01335

----------------------------------------------------------------------------------------
                       |               Robust
DLnRealAverageCompen~n | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
 DLnNetProductivityNDP |   1.485718   .2422085     6.13   0.000     .9747028    1.996733
                       |
UnemploymentRestricted |
                   --. |   .2880314   .5865416     0.49   0.630    -.9494632    1.525526
                   L1. |  -1.070353   .6344575    -1.69   0.110    -2.408941    .2682356
                       |
          CPIInflation |  -1.141161   .2639747    -4.32   0.000    -1.698099   -.5842228
                 _cons |   .0659354   .0112138     5.88   0.000     .0422763    .0895946
----------------------------------------------------------------------------------------

 ( 1)  DLnNetProductivityNDP = 1

       F(  1,    17) =    4.02
            Prob > F =    0.0611

. 
end of do-file

. reg Ma3DLnRealAverageWage Ma3DLnNetProductivityNDP Ma3UnemploymentRestricted, robust

Linear regression                               Number of obs     =         22
                                                F(2, 19)          =      15.55
                                                Prob > F          =     0.0001
                                                R-squared         =     0.7159
                                                Root MSE          =     .01069

-------------------------------------------------------------------------------------------
                          |               Robust
    Ma3DLnRealAverageWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------------+----------------------------------------------------------------
 Ma3DLnNetProductivityNDP |   1.234017   .2816361     4.38   0.000     .6445461    1.823488
Ma3UnemploymentRestricted |  -.6267298   .2826344    -2.22   0.039     -1.21829   -.0351691
                    _cons |   .0269332   .0137015     1.97   0.064    -.0017445    .0556108
-------------------------------------------------------------------------------------------

. reg Ma3DLnRealAverageWage Ma3DLnNetProductivityNDP, robust

Linear regression                               Number of obs     =         22
                                                F(1, 20)          =      25.19
                                                Prob > F          =     0.0001
                                                R-squared         =     0.6236
                                                Root MSE          =     .01199

------------------------------------------------------------------------------------------
                         |               Robust
   Ma3DLnRealAverageWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
Ma3DLnNetProductivityNDP |    1.37437   .2738592     5.02   0.000     .8031101    1.945631
                   _cons |  -.0036162   .0049953    -0.72   0.477    -.0140362    .0068038
------------------------------------------------------------------------------------------

. do "C:\Users\Admin\AppData\Local\Temp\STD6554_000000.tmp"

. foreach var of varlist DLnRealMedianWage DLnRealAverageWage DLnRealAverageCompensation {
  2.         reg `var' DLnNetProductivityNDP UnemploymentRestricted L.UnemploymentRestricted CPIInflation, robust
  3.         test DLnNetProductivityNDP = 1
  4. }

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =       8.85
                                                Prob > F          =     0.0005
                                                R-squared         =     0.7344
                                                Root MSE          =     .01097

----------------------------------------------------------------------------------------
                       |               Robust
     DLnRealMedianWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
 DLnNetProductivityNDP |   .6207991   .1989581     3.12   0.006     .2010342    1.040564
                       |
UnemploymentRestricted |
                   --. |   -.292088   .4880682    -0.60   0.557    -1.321822    .7376459
                   L1. |  -.4843355   .5737072    -0.84   0.410    -1.694752     .726081
                       |
          CPIInflation |  -1.067386   .2398534    -4.45   0.000    -1.573432   -.5613394
                 _cons |   .0674438   .0121812     5.54   0.000     .0417437    .0931439
----------------------------------------------------------------------------------------

 ( 1)  DLnNetProductivityNDP = 1

       F(  1,    17) =    3.63
            Prob > F =    0.0737

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      13.03
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6850
                                                Root MSE          =     .01275

----------------------------------------------------------------------------------------
                       |               Robust
    DLnRealAverageWage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
 DLnNetProductivityNDP |   .8270822   .2448329     3.38   0.004     .3105299    1.343634
                       |
UnemploymentRestricted |
                   --. |  -.0442959   .5660392    -0.08   0.939    -1.238534    1.149942
                   L1. |  -.7327666   .6706094    -1.09   0.290    -2.147629    .6820956
                       |
          CPIInflation |  -1.008934   .2561766    -3.94   0.001     -1.54942   -.4684488
                 _cons |   .0656551   .0115204     5.70   0.000     .0413492     .089961
----------------------------------------------------------------------------------------

 ( 1)  DLnNetProductivityNDP = 1

       F(  1,    17) =    0.50
            Prob > F =    0.4896

Linear regression                               Number of obs     =         22
                                                F(4, 17)          =      22.64
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7837
                                                Root MSE          =     .01335

----------------------------------------------------------------------------------------
                       |               Robust
DLnRealAverageCompen~n | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
 DLnNetProductivityNDP |   1.485718   .2422085     6.13   0.000     .9747028    1.996733
                       |
UnemploymentRestricted |
                   --. |   .2880314   .5865416     0.49   0.630    -.9494632    1.525526
                   L1. |  -1.070353   .6344575    -1.69   0.110    -2.408941    .2682356
                       |
          CPIInflation |  -1.141161   .2639747    -4.32   0.000    -1.698099   -.5842228
                 _cons |   .0659354   .0112138     5.88   0.000     .0422763    .0895946
----------------------------------------------------------------------------------------

 ( 1)  DLnNetProductivityNDP = 1

       F(  1,    17) =    4.02
            Prob > F =    0.0611

. 
end of do-file

. test CPIInflation=0

 ( 1)  CPIInflation = 0

       F(  1,    17) =   18.69
            Prob > F =    0.0005

. 
